burakenez/gd32e502-demo-suites-cmake-vscode/Drivers/GD32E502_standard_peripheral/Include/gd32e502_rcu.h
/* RCU_AHBRST */
#define RCU_AHBRST_DMA0RST              BIT(0)                                /*!< DMA0 reset */
#define RCU_AHBRST_DMA1RST              BIT(1)                                /*!< DMA1 reset */
#define RCU_AHBRST_DMAMUXRST            BIT(3)                                /*!< DMAMUX reset */
#define RCU_AHBRST_CRCRST               BIT(6)                                /*!< CRC reset */
#define RCU_AHBRST_MFCOMRST             BIT(14)                               /*!< MFCOM reset */
#define RCU_AHBRST_PARST                BIT(17)                               /*!< GPIO port A reset */
#define RCU_AHBRST_PBRST                BIT(18)                               /*!< GPIO port B reset */
#define RCU_AHBRST_PCRST                BIT(19)                               /*!< GPIO port C reset */
#define RCU_AHBRST_PDRST                BIT(20)                               /*!< GPIO port D reset */
#define RCU_AHBRST_PERST                BIT(21)                               /*!< GPIO port E reset */
#define RCU_AHBRST_PFRST                BIT(22)                               /*!< GPIO port F reset */

/* RCU_CFG1 */
#define RCU_CFG1_PREDV                  BITS(0,3)                             /*!< CK_HXTAL divider previous PLL */

/* RCU_CFG2 */
#define RCU_CFG2_USART0SEL              BITS(0,1)                             /*!< USART0 clock source selection */
#define RCU_CFG2_USART1SEL              BITS(4,5)                             /*!< USART1 clock source selection */
#define RCU_CFG2_USART2SEL              BITS(6,7)                             /*!< USART2 clock source selection */
#define RCU_CFG2_CAN0SEL                BITS(12,13)                           /*!< CAN0 clock source selection */
#define RCU_CFG2_CAN1SEL                BITS(14,15)                           /*!< CAN1 clock source selection */
#define RCU_CFG2_ADCPSC                 BITS(27,31)                           /*!< ADC prescaler selection */

/* RCU_VKEY */
#define RCU_VKEY_UNLOCK                 0x1A2B3C4DU                           /*!< the key of RCU_DSV register */
/* RCU_VKEY */
#define RCU_VKEY_KEY                    BITS(0,31)
/* RCU_DSV */
#define RCU_DSV_DSLPVS                  BITS(0,1)                             /*!< Deep-sleep mode voltage selection */

/* constants definitions */
/* define the peripheral clock enable bit position and its register index offset */
#define RCU_REGIDX_BIT(regidx, bitpos)      (((uint32_t)(regidx) << 6) | (uint32_t)(bitpos))
#define RCU_REG_VAL(periph)                 (REG32(RCU + ((uint32_t)(periph) >> 6)))
#define RCU_BIT_POS(val)                    ((uint32_t)(val) & 0x0000001FU)

/* register offset */
/* peripherals enable */
#define AHBEN_REG_OFFSET                0x00000014U                          /*!< AHB enable register offset */
#define APB1EN_REG_OFFSET               0x0000001CU                          /*!< APB1 enable register offset */
#define APB2EN_REG_OFFSET               0x00000018U                          /*!< APB2 enable register offset */

/* peripherals reset */
#define AHBRST_REG_OFFSET               0x00000028U                          /*!< AHB reset register offset */
#define APB1RST_REG_OFFSET              0x00000010U                          /*!< APB1 reset register offset */
#define APB2RST_REG_OFFSET              0x0000000CU                          /*!< APB2 reset register offset */
#define RSTSCK_REG_OFFSET               0x00000024U                          /*!< reset source/clock register offset */

/* clock control */
#define CTL_REG_OFFSET                  0x00000000U                          /*!< control register offset */
#define BDCTL_REG_OFFSET                0x00000020U                          /*!< backup domain control register offset */

/* clock stabilization and stuck interrupt */
#define INT_REG_OFFSET                  0x00000008U                          /*!< clock interrupt register offset */

/* configuration register */
#define CFG0_REG_OFFSET                 0x00000004U                          /*!< clock configuration register 0 offset */
#define CFG1_REG_OFFSET                 0x0000002CU                          /*!< clock configuration register 1 offset */

/* peripheral clock enable */
typedef enum {
    /* AHB peripherals */
    RCU_DMA0      = RCU_REGIDX_BIT(AHBEN_REG_OFFSET, 0U),                    /*!< DMA0 clock */
    RCU_DMA1      = RCU_REGIDX_BIT(AHBEN_REG_OFFSET, 1U),                    /*!< DMA1 clock */
    RCU_DMAMUX    = RCU_REGIDX_BIT(AHBEN_REG_OFFSET, 3U),                    /*!< DMAMUX clock */
    RCU_CRC       = RCU_REGIDX_BIT(AHBEN_REG_OFFSET, 6U),                    /*!< CRC clock */
    RCU_MFCOM     = RCU_REGIDX_BIT(AHBEN_REG_OFFSET, 14U),                   /*!< MFCOM clock */
    RCU_GPIOA     = RCU_REGIDX_BIT(AHBEN_REG_OFFSET, 17U),                   /*!< GPIOA clock */
    RCU_GPIOB     = RCU_REGIDX_BIT(AHBEN_REG_OFFSET, 18U),                   /*!< GPIOB clock */
    RCU_GPIOC     = RCU_REGIDX_BIT(AHBEN_REG_OFFSET, 19U),                   /*!< GPIOC clock */
    RCU_GPIOD     = RCU_REGIDX_BIT(AHBEN_REG_OFFSET, 20U),                   /*!< GPIOD clock */
    RCU_GPIOE     = RCU_REGIDX_BIT(AHBEN_REG_OFFSET, 21U),                   /*!< GPIOE clock */
    RCU_GPIOF     = RCU_REGIDX_BIT(AHBEN_REG_OFFSET, 22U),                   /*!< GPIOF clock */
    /* APB2 peripherals */
    RCU_SYSCFG    = RCU_REGIDX_BIT(APB2EN_REG_OFFSET, 0U),                   /*!< SYSCFG clock */
    RCU_CMP       = RCU_REGIDX_BIT(APB2EN_REG_OFFSET, 1U),                   /*!< CMP clock */
    RCU_ADC0      = RCU_REGIDX_BIT(APB2EN_REG_OFFSET, 9U),                   /*!< ADC0 clock */
    RCU_ADC1      = RCU_REGIDX_BIT(APB2EN_REG_OFFSET, 10U),                  /*!< ADC1 clock */
    RCU_TIMER0    = RCU_REGIDX_BIT(APB2EN_REG_OFFSET, 11U),                  /*!< TIMER0 clock */
    RCU_SPI0      = RCU_REGIDX_BIT(APB2EN_REG_OFFSET, 12U),                  /*!< SPI0 clock */
    RCU_TIMER7    = RCU_REGIDX_BIT(APB2EN_REG_OFFSET, 13U),                  /*!< TIMER7 clock */
    RCU_USART0    = RCU_REGIDX_BIT(APB2EN_REG_OFFSET, 14U),                  /*!< USART0 clock */
    RCU_TIMER19   = RCU_REGIDX_BIT(APB2EN_REG_OFFSET, 20U),                  /*!< TIMER19 clock */
    RCU_TIMER20   = RCU_REGIDX_BIT(APB2EN_REG_OFFSET, 21U),                  /*!< TIMER20 clock */
    RCU_TRIGSEL   = RCU_REGIDX_BIT(APB2EN_REG_OFFSET, 29U),                  /*!< TRIGSEL clock */
    RCU_CAN0      = RCU_REGIDX_BIT(APB2EN_REG_OFFSET, 30U),                  /*!< CAN0 clock */
    RCU_CAN1      = RCU_REGIDX_BIT(APB2EN_REG_OFFSET, 31U),                  /*!< CAN1 clock */
    /* APB1 peripherals */
    RCU_TIMER1    = RCU_REGIDX_BIT(APB1EN_REG_OFFSET, 0U),                   /*!< TIMER1 clock */
    RCU_TIMER5    = RCU_REGIDX_BIT(APB1EN_REG_OFFSET, 4U),                   /*!< TIMER5 clock */
    RCU_TIMER6    = RCU_REGIDX_BIT(APB1EN_REG_OFFSET, 5U),                   /*!< TIMER6 clock */
    RCU_WWDGT     = RCU_REGIDX_BIT(APB1EN_REG_OFFSET, 11U),                  /*!< WWDGT clock */
    RCU_SPI1      = RCU_REGIDX_BIT(APB1EN_REG_OFFSET, 14U),                  /*!< SPI1 clock */
    RCU_USART1    = RCU_REGIDX_BIT(APB1EN_REG_OFFSET, 17U),                  /*!< USART1 clock */
    RCU_USART2    = RCU_REGIDX_BIT(APB1EN_REG_OFFSET, 18U),                  /*!< USART2 clock */
    RCU_I2C0      = RCU_REGIDX_BIT(APB1EN_REG_OFFSET, 21U),                  /*!< I2C0 clock */
    RCU_I2C1      = RCU_REGIDX_BIT(APB1EN_REG_OFFSET, 22U),                  /*!< I2C1 clock */
    RCU_BKP       = RCU_REGIDX_BIT(APB1EN_REG_OFFSET, 27U),                  /*!< BKP clock */
    RCU_PMU       = RCU_REGIDX_BIT(APB1EN_REG_OFFSET, 28U),                  /*!< PMU clock */
    RCU_DAC       = RCU_REGIDX_BIT(APB1EN_REG_OFFSET, 29U),                  /*!< DAC clock */
    RCU_RTC       = RCU_REGIDX_BIT(BDCTL_REG_OFFSET, 15U),                   /*!< RTC clock */
} rcu_periph_enum;


