burakenez/gd32e502-demo-suites-cmake-vscode/Drivers/GD32E502_standard_peripheral/Include/gd32e502_rcu.h
/* peripherals reset */
typedef enum {
    /* AHB peripherals */
    RCU_DMA0RST     = RCU_REGIDX_BIT(AHBRST_REG_OFFSET, 0U),                 /*!< DMA0 clock reset */
    RCU_DMA1RST     = RCU_REGIDX_BIT(AHBRST_REG_OFFSET, 1U),                 /*!< DMA1 clock reset */
    RCU_DMAMUXRST   = RCU_REGIDX_BIT(AHBRST_REG_OFFSET, 3U),                 /*!< DMAMUX clock reset */
    RCU_CRCRST      = RCU_REGIDX_BIT(AHBRST_REG_OFFSET, 6U),                 /*!< CRC clock reset */
    RCU_MFCOMRST    = RCU_REGIDX_BIT(AHBRST_REG_OFFSET, 14U),                /*!< MFCOM clock reset */
    RCU_GPIOARST    = RCU_REGIDX_BIT(AHBRST_REG_OFFSET, 17U),                /*!< GPIOA clock reset */
    RCU_GPIOBRST    = RCU_REGIDX_BIT(AHBRST_REG_OFFSET, 18U),                /*!< GPIOB clock reset */
    RCU_GPIOCRST    = RCU_REGIDX_BIT(AHBRST_REG_OFFSET, 19U),                /*!< GPIOC clock reset */
    RCU_GPIODRST    = RCU_REGIDX_BIT(AHBRST_REG_OFFSET, 20U),                /*!< GPIOD clock reset */
    RCU_GPIOERST    = RCU_REGIDX_BIT(AHBRST_REG_OFFSET, 21U),                /*!< GPIOE clock reset */
    RCU_GPIOFRST    = RCU_REGIDX_BIT(AHBRST_REG_OFFSET, 22U),                /*!< GPIOF clock reset */
    /* APB2 peripherals */
    RCU_SYSCFGRST   = RCU_REGIDX_BIT(APB2RST_REG_OFFSET, 0U),                /*!< system configuration reset */
    RCU_CMPRST      = RCU_REGIDX_BIT(APB2RST_REG_OFFSET, 1U),                /*!< Comparator reset */
    RCU_ADC0RST     = RCU_REGIDX_BIT(APB2RST_REG_OFFSET, 9U),                /*!< ADC0 clock reset */
    RCU_ADC1RST     = RCU_REGIDX_BIT(APB2RST_REG_OFFSET, 10U),               /*!< ADC1 clock reset */
    RCU_TIMER0RST   = RCU_REGIDX_BIT(APB2RST_REG_OFFSET, 11U),               /*!< TIMER0 clock reset */
    RCU_SPI0RST     = RCU_REGIDX_BIT(APB2RST_REG_OFFSET, 12U),               /*!< SPI0 clock reset */
    RCU_TIMER7RST   = RCU_REGIDX_BIT(APB2RST_REG_OFFSET, 13U),               /*!< TIMER7 clock reset */
    RCU_USART0RST   = RCU_REGIDX_BIT(APB2RST_REG_OFFSET, 14U),               /*!< USART0 clock reset */
    RCU_TIMER19RST  = RCU_REGIDX_BIT(APB2RST_REG_OFFSET, 20U),               /*!< TIMER19 clock reset */
    RCU_TIMER20RST  = RCU_REGIDX_BIT(APB2RST_REG_OFFSET, 21U),               /*!< TIMER20 clock reset */
    RCU_CAN0RST     = RCU_REGIDX_BIT(APB2RST_REG_OFFSET, 30U),               /*!< CAN0 clock reset */
    RCU_CAN1RST     = RCU_REGIDX_BIT(APB2RST_REG_OFFSET, 31U),               /*!< CAN1 clock reset */
    /* APB1 peripherals */
    RCU_TIMER1RST   = RCU_REGIDX_BIT(APB1RST_REG_OFFSET, 0U),                /*!< TIMER1 clock reset */
    RCU_TIMER5RST   = RCU_REGIDX_BIT(APB1RST_REG_OFFSET, 4U),                /*!< TIMER5 clock reset */
    RCU_TIMER6RST   = RCU_REGIDX_BIT(APB1RST_REG_OFFSET, 5U),                /*!< TIMER6 clock reset */
    RCU_WWDGTRST    = RCU_REGIDX_BIT(APB1RST_REG_OFFSET, 11U),               /*!< WWDGT clock reset */
    RCU_SPI1RST     = RCU_REGIDX_BIT(APB1RST_REG_OFFSET, 14U),               /*!< SPI1 clock reset */
    RCU_USART1RST   = RCU_REGIDX_BIT(APB1RST_REG_OFFSET, 17U),               /*!< USART1 clock reset */
    RCU_USART2RST   = RCU_REGIDX_BIT(APB1RST_REG_OFFSET, 18U),               /*!< USART2 clock reset */
    RCU_I2C0RST     = RCU_REGIDX_BIT(APB1RST_REG_OFFSET, 21U),               /*!< I2C0 clock reset */
    RCU_I2C1RST     = RCU_REGIDX_BIT(APB1RST_REG_OFFSET, 22U),               /*!< I2C1 clock reset */
    RCU_PMURST      = RCU_REGIDX_BIT(APB1RST_REG_OFFSET, 28U),               /*!< PMU clock reset */
    RCU_DACRST      = RCU_REGIDX_BIT(APB1RST_REG_OFFSET, 29U),               /*!< DAC clock reset */
} rcu_periph_reset_enum;

/* peripheral clock enable when sleep mode*/
typedef enum {
    /* AHB peripherals */
    RCU_SRAM_SLP     = RCU_REGIDX_BIT(AHBEN_REG_OFFSET, 2U),                 /*!< SRAM clock */
    RCU_FMC_SLP      = RCU_REGIDX_BIT(AHBEN_REG_OFFSET, 4U),                 /*!< FMC clock */
} rcu_periph_sleep_enum;

/* clock stabilization and peripheral reset flags */
typedef enum {
    /* clock stabilization flags */
    RCU_FLAG_IRC8MSTB      = RCU_REGIDX_BIT(CTL_REG_OFFSET, 1U),             /*!< IRC8M stabilization flag */
    RCU_FLAG_HXTALSTB      = RCU_REGIDX_BIT(CTL_REG_OFFSET, 17U),            /*!< HXTAL stabilization flag */
    RCU_FLAG_PLLSTB        = RCU_REGIDX_BIT(CTL_REG_OFFSET, 25U),            /*!< PLL stabilization flag */
    RCU_FLAG_LXTALSTB      = RCU_REGIDX_BIT(BDCTL_REG_OFFSET, 1U),           /*!< LXTAL stabilization flag */
    /* reset source flags */
    RCU_FLAG_IRC40KSTB     = RCU_REGIDX_BIT(RSTSCK_REG_OFFSET, 1U),          /*!< IRC40K stabilization flag */
    RCU_FLAG_BORRST        = RCU_REGIDX_BIT(RSTSCK_REG_OFFSET, 17U),         /*!< BOR reset flag */
    RCU_FLAG_LOCKUPRST     = RCU_REGIDX_BIT(RSTSCK_REG_OFFSET, 18U),         /*!< CPU LOCK UP error reset flag */
    RCU_FLAG_LVDRST        = RCU_REGIDX_BIT(RSTSCK_REG_OFFSET, 19U),         /*!< low voltage detect error reset flag */
    RCU_FLAG_ECCRST        = RCU_REGIDX_BIT(RSTSCK_REG_OFFSET, 20U),         /*!< 2 bits ECC error reset flag */
    RCU_FLAG_LOHRST        = RCU_REGIDX_BIT(RSTSCK_REG_OFFSET, 21U),         /*!< lost of HXTAL error reset flag */
    RCU_FLAG_LOPRST        = RCU_REGIDX_BIT(RSTSCK_REG_OFFSET, 22U),         /*!< lost of PLL error reset flag */
    RCU_FLAG_V11RST        = RCU_REGIDX_BIT(RSTSCK_REG_OFFSET, 23U),         /*!< 1.1V domain Power reset flag */
    RCU_FLAG_OBLRST        = RCU_REGIDX_BIT(RSTSCK_REG_OFFSET, 25U),         /*!< option byte loader reset flag */
    RCU_FLAG_EPRST         = RCU_REGIDX_BIT(RSTSCK_REG_OFFSET, 26U),         /*!< external PIN reset flag */
    RCU_FLAG_PORRST        = RCU_REGIDX_BIT(RSTSCK_REG_OFFSET, 27U),         /*!< power reset flag */
    RCU_FLAG_SWRST         = RCU_REGIDX_BIT(RSTSCK_REG_OFFSET, 28U),         /*!< software reset flag */
    RCU_FLAG_FWDGTRST      = RCU_REGIDX_BIT(RSTSCK_REG_OFFSET, 29U),         /*!< FWDGT reset flag */
    RCU_FLAG_WWDGTRST      = RCU_REGIDX_BIT(RSTSCK_REG_OFFSET, 30U),         /*!< WWDGT reset flag */
    RCU_FLAG_LPRST         = RCU_REGIDX_BIT(RSTSCK_REG_OFFSET, 31U),         /*!< low-power reset flag */
} rcu_flag_enum;

/* clock stabilization and ckm interrupt flags */
typedef enum {
    RCU_INT_FLAG_IRC40KSTB = RCU_REGIDX_BIT(INT_REG_OFFSET, 0U),             /*!< IRC40K stabilization interrupt flag */
    RCU_INT_FLAG_LXTALSTB  = RCU_REGIDX_BIT(INT_REG_OFFSET, 1U),             /*!< LXTAL stabilization interrupt flag */
    RCU_INT_FLAG_IRC8MSTB  = RCU_REGIDX_BIT(INT_REG_OFFSET, 2U),             /*!< IRC8M stabilization interrupt flag */
    RCU_INT_FLAG_HXTALSTB  = RCU_REGIDX_BIT(INT_REG_OFFSET, 3U),             /*!< HXTAL stabilization interrupt flag */
    RCU_INT_FLAG_PLLSTB    = RCU_REGIDX_BIT(INT_REG_OFFSET, 4U),             /*!< PLL stabilization interrupt flag */
    RCU_INT_FLAG_LCKM      = RCU_REGIDX_BIT(INT_REG_OFFSET, 5U),             /*!< LXTAL clock monitor interrupt flag */
    RCU_INT_FLAG_PLLM      = RCU_REGIDX_BIT(INT_REG_OFFSET, 6U),             /*!< PLL clock monitor interrupt flag */
    RCU_INT_FLAG_CKM       = RCU_REGIDX_BIT(INT_REG_OFFSET, 7U),             /*!< HXTAL clock stuck interrupt flag */
} rcu_int_flag_enum;

