burakenez/gd32e502-demo-suites-cmake-vscode/Drivers/GD32E502_standard_peripheral/Include/gd32e502_rcu.h
/* clock stabilization and stuck interrupt flags clear */
typedef enum {
    RCU_INT_FLAG_IRC40KSTB_CLR = RCU_REGIDX_BIT(INT_REG_OFFSET, 16U),        /*!< IRC40K stabilization interrupt flag clear */
    RCU_INT_FLAG_LXTALSTB_CLR  = RCU_REGIDX_BIT(INT_REG_OFFSET, 17U),        /*!< LXTAL stabilization interrupt flag clear */
    RCU_INT_FLAG_IRC8MSTB_CLR  = RCU_REGIDX_BIT(INT_REG_OFFSET, 18U),        /*!< IRC8M stabilization interrupt flag clear */
    RCU_INT_FLAG_HXTALSTB_CLR  = RCU_REGIDX_BIT(INT_REG_OFFSET, 19U),        /*!< HXTAL stabilization interrupt flag clear */
    RCU_INT_FLAG_PLLSTB_CLR    = RCU_REGIDX_BIT(INT_REG_OFFSET, 20U),        /*!< PLL stabilization interrupt flag clear */
    RCU_INT_FLAG_LCKM_CLR      = RCU_REGIDX_BIT(INT_REG_OFFSET, 21U),        /*!< LXTAL clock monitor interrupt clear */
    RCU_INT_FLAG_PLLM_CLR      = RCU_REGIDX_BIT(INT_REG_OFFSET, 22U),        /*!< PLL clock monitor interrupt clear */
    RCU_INT_FLAG_CKM_CLR       = RCU_REGIDX_BIT(INT_REG_OFFSET, 23U),        /*!< CKM interrupt flag clear */
} rcu_int_flag_clear_enum;

/* clock stabilization interrupt enable or disable */
typedef enum {
    RCU_INT_IRC40KSTB          = RCU_REGIDX_BIT(INT_REG_OFFSET, 8U),         /*!< IRC40K stabilization interrupt enable */
    RCU_INT_LXTALSTB           = RCU_REGIDX_BIT(INT_REG_OFFSET, 9U),         /*!< LXTAL stabilization interrupt enable */
    RCU_INT_IRC8MSTB           = RCU_REGIDX_BIT(INT_REG_OFFSET, 10U),        /*!< IRC8M stabilization interrupt enable */
    RCU_INT_HXTALSTB           = RCU_REGIDX_BIT(INT_REG_OFFSET, 11U),        /*!< HXTAL stabilization interrupt enable */
    RCU_INT_PLLSTB             = RCU_REGIDX_BIT(INT_REG_OFFSET, 12U),        /*!< PLL stabilization interrupt enable */
    RCU_INT_LCKM               = RCU_REGIDX_BIT(INT_REG_OFFSET, 13U),        /*!< LXTAL clock monitor interrupt enable */
    RCU_INT_PLLM               = RCU_REGIDX_BIT(INT_REG_OFFSET, 14U),        /*!< PLL clock monitor interrupt enable */
} rcu_int_enum;

/* oscillator types */
typedef enum {
    RCU_HXTAL                  = RCU_REGIDX_BIT(CTL_REG_OFFSET, 16U),        /*!< HXTAL */
    RCU_LXTAL                  = RCU_REGIDX_BIT(BDCTL_REG_OFFSET, 0U),       /*!< LXTAL */
    RCU_IRC8M                  = RCU_REGIDX_BIT(CTL_REG_OFFSET, 0U),         /*!< IRC8M */
    RCU_IRC40K                 = RCU_REGIDX_BIT(RSTSCK_REG_OFFSET, 0U),      /*!< IRC40K */
    RCU_PLL_CK                 = RCU_REGIDX_BIT(CTL_REG_OFFSET, 24U),        /*!< PLL */
} rcu_osci_type_enum;

/* rcu clock frequency */
typedef enum {
    CK_SYS      = 0,                                                         /*!< system clock */
    CK_AHB,                                                                  /*!< AHB clock */
    CK_APB1,                                                                 /*!< APB1 clock */
    CK_APB2,                                                                 /*!< APB2 clock */
    CK_USART0,                                                               /*!< USART0 clock */
    CK_USART1,                                                               /*!< USART1 clock */
    CK_USART2,                                                               /*!< USART2 clock */
} rcu_clock_freq_enum;

/* HXTAL frequency scale select */
#define HXTAL_SCALE_2M_TO_8M            0x00000000U                          /*!< HXTAL scale is 2M-8MHz */
#define HXTAL_SCALE_8M_TO_40M           RCU_CTL_HXTALSCAL                    /*!< HXTAL scale is 8M-40MHz */

/* RCU_CFG0 register bit define */
/* system clock source select */
#define CFG0_SCS(regval)                (BITS(0,1) & ((uint32_t)(regval) << 0))
#define RCU_CKSYSSRC_IRC8M              CFG0_SCS(0)                          /*!< system clock source select IRC8M */
#define RCU_CKSYSSRC_HXTAL              CFG0_SCS(1)                          /*!< system clock source select HXTAL */
#define RCU_CKSYSSRC_PLL                CFG0_SCS(2)                          /*!< system clock source select PLL */

/* system clock source select status */
#define CFG0_SCSS(regval)               (BITS(2,3) & ((uint32_t)(regval) << 2))
#define RCU_SCSS_IRC8M                  CFG0_SCSS(0)                         /*!< system clock source select IRC8M */
#define RCU_SCSS_HXTAL                  CFG0_SCSS(1)                         /*!< system clock source select HXTAL */
#define RCU_SCSS_PLL                    CFG0_SCSS(2)                         /*!< system clock source select PLL */

/* AHB prescaler selection */
#define CFG0_AHBPSC(regval)             (BITS(4,7) & ((uint32_t)(regval) << 4))
#define RCU_AHB_CKSYS_DIV1              CFG0_AHBPSC(0)                       /*!< AHB prescaler select CK_SYS */
#define RCU_AHB_CKSYS_DIV2              CFG0_AHBPSC(8)                       /*!< AHB prescaler select CK_SYS/2 */
#define RCU_AHB_CKSYS_DIV4              CFG0_AHBPSC(9)                       /*!< AHB prescaler select CK_SYS/4 */
#define RCU_AHB_CKSYS_DIV8              CFG0_AHBPSC(10)                      /*!< AHB prescaler select CK_SYS/8 */
#define RCU_AHB_CKSYS_DIV16             CFG0_AHBPSC(11)                      /*!< AHB prescaler select CK_SYS/16 */
#define RCU_AHB_CKSYS_DIV64             CFG0_AHBPSC(12)                      /*!< AHB prescaler select CK_SYS/64 */
#define RCU_AHB_CKSYS_DIV128            CFG0_AHBPSC(13)                      /*!< AHB prescaler select CK_SYS/128 */
#define RCU_AHB_CKSYS_DIV256            CFG0_AHBPSC(14)                      /*!< AHB prescaler select CK_SYS/256 */
#define RCU_AHB_CKSYS_DIV512            CFG0_AHBPSC(15)                      /*!< AHB prescaler select CK_SYS/512 */

/* APB1 prescaler selection */
#define CFG0_APB1PSC(regval)            (BITS(8,10) & ((uint32_t)(regval) << 8))
#define RCU_APB1_CKAHB_DIV1             CFG0_APB1PSC(0)                      /*!< APB1 prescaler select CK_AHB */
#define RCU_APB1_CKAHB_DIV2             CFG0_APB1PSC(4)                      /*!< APB1 prescaler select CK_AHB/2 */
#define RCU_APB1_CKAHB_DIV4             CFG0_APB1PSC(5)                      /*!< APB1 prescaler select CK_AHB/4 */
#define RCU_APB1_CKAHB_DIV8             CFG0_APB1PSC(6)                      /*!< APB1 prescaler select CK_AHB/8 */
#define RCU_APB1_CKAHB_DIV16            CFG0_APB1PSC(7)                      /*!< APB1 prescaler select CK_AHB/16 */

/* APB2 prescaler selection */
#define CFG0_APB2PSC(regval)            (BITS(11,13) & ((uint32_t)(regval) << 11))
#define RCU_APB2_CKAHB_DIV1             CFG0_APB2PSC(0)                      /*!< APB2 prescaler select CK_AHB */
#define RCU_APB2_CKAHB_DIV2             CFG0_APB2PSC(4)                      /*!< APB2 prescaler select CK_AHB/2 */
#define RCU_APB2_CKAHB_DIV4             CFG0_APB2PSC(5)                      /*!< APB2 prescaler select CK_AHB/4 */
#define RCU_APB2_CKAHB_DIV8             CFG0_APB2PSC(6)                      /*!< APB2 prescaler select CK_AHB/8 */
#define RCU_APB2_CKAHB_DIV16            CFG0_APB2PSC(7)                      /*!< APB2 prescaler select CK_AHB/16 */

/* RCU system reset */
#define RCU_SYSRST_LOCKUP               RCU_RSTSCK_LOCKUPRSTEN               /*!< CPU lock-up reset */
#define RCU_SYSRST_LVD                  RCU_RSTSCK_LVDRSTEN                  /*!< low voltage detect reset */
#define RCU_SYSRST_ECC                  RCU_RSTSCK_ECCRSTEN                  /*!< ECC 2 bits error reset */
#define RCU_SYSRST_LOH                  RCU_RSTSCK_LOHRSTEN                  /*!< lost of HXTAL error reset */
#define RCU_SYSRST_LOP                  RCU_RSTSCK_LOPRSTEN                  /*!< lost of PLL reset */

/* ADC prescaler select */
#define CFG2_ADCPSC(regval)             (BITS(27,31) & ((uint32_t)(regval) << 27))
#define RCU_CKADC_CKAHB_DIV2            CFG2_ADCPSC(0)                       /*!< ADC prescaler select CK_AHB/2 */
#define RCU_CKADC_CKAHB_DIV3            CFG2_ADCPSC(1)                       /*!< ADC prescaler select CK_AHB/3 */
#define RCU_CKADC_CKAHB_DIV4            CFG2_ADCPSC(2)                       /*!< ADC prescaler select CK_AHB/4 */
#define RCU_CKADC_CKAHB_DIV5            CFG2_ADCPSC(3)                       /*!< ADC prescaler select CK_AHB/5 */
#define RCU_CKADC_CKAHB_DIV6            CFG2_ADCPSC(4)                       /*!< ADC prescaler select CK_AHB/6 */
#define RCU_CKADC_CKAHB_DIV7            CFG2_ADCPSC(5)                       /*!< ADC prescaler select CK_AHB/7 */
#define RCU_CKADC_CKAHB_DIV8            CFG2_ADCPSC(6)                       /*!< ADC prescaler select CK_AHB/8 */
#define RCU_CKADC_CKAHB_DIV9            CFG2_ADCPSC(7)                       /*!< ADC prescaler select CK_AHB/9 */
#define RCU_CKADC_CKAHB_DIV10           CFG2_ADCPSC(8)                       /*!< ADC prescaler select CK_AHB/10 */
#define RCU_CKADC_CKAHB_DIV11           CFG2_ADCPSC(9)                       /*!< ADC prescaler select CK_AHB/11 */
#define RCU_CKADC_CKAHB_DIV12           CFG2_ADCPSC(10)                      /*!< ADC prescaler select CK_AHB/12 */
#define RCU_CKADC_CKAHB_DIV13           CFG2_ADCPSC(11)                      /*!< ADC prescaler select CK_AHB/13 */
#define RCU_CKADC_CKAHB_DIV14           CFG2_ADCPSC(12)                      /*!< ADC prescaler select CK_AHB/14 */
#define RCU_CKADC_CKAHB_DIV15           CFG2_ADCPSC(13)                      /*!< ADC prescaler select CK_AHB/15 */
#define RCU_CKADC_CKAHB_DIV16           CFG2_ADCPSC(14)                      /*!< ADC prescaler select CK_AHB/16 */
#define RCU_CKADC_CKAHB_DIV17           CFG2_ADCPSC(15)                      /*!< ADC prescaler select CK_AHB/17 */
#define RCU_CKADC_CKAHB_DIV18           CFG2_ADCPSC(16)                      /*!< ADC prescaler select CK_AHB/18 */
#define RCU_CKADC_CKAHB_DIV19           CFG2_ADCPSC(17)                      /*!< ADC prescaler select CK_AHB/19 */
#define RCU_CKADC_CKAHB_DIV20           CFG2_ADCPSC(18)                      /*!< ADC prescaler select CK_AHB/20 */
#define RCU_CKADC_CKAHB_DIV21           CFG2_ADCPSC(19)                      /*!< ADC prescaler select CK_AHB/21 */
#define RCU_CKADC_CKAHB_DIV22           CFG2_ADCPSC(20)                      /*!< ADC prescaler select CK_AHB/22 */
#define RCU_CKADC_CKAHB_DIV23           CFG2_ADCPSC(21)                      /*!< ADC prescaler select CK_AHB/23 */
#define RCU_CKADC_CKAHB_DIV24           CFG2_ADCPSC(22)                      /*!< ADC prescaler select CK_AHB/24 */
#define RCU_CKADC_CKAHB_DIV25           CFG2_ADCPSC(23)                      /*!< ADC prescaler select CK_AHB/25 */
#define RCU_CKADC_CKAHB_DIV26           CFG2_ADCPSC(24)                      /*!< ADC prescaler select CK_AHB/26 */
#define RCU_CKADC_CKAHB_DIV27           CFG2_ADCPSC(25)                      /*!< ADC prescaler select CK_AHB/27 */
#define RCU_CKADC_CKAHB_DIV28           CFG2_ADCPSC(26)                      /*!< ADC prescaler select CK_AHB/28 */
#define RCU_CKADC_CKAHB_DIV29           CFG2_ADCPSC(27)                      /*!< ADC prescaler select CK_AHB/29 */
#define RCU_CKADC_CKAHB_DIV30           CFG2_ADCPSC(28)                      /*!< ADC prescaler select CK_AHB/30 */
#define RCU_CKADC_CKAHB_DIV31           CFG2_ADCPSC(29)                      /*!< ADC prescaler select CK_AHB/31 */
#define RCU_CKADC_CKAHB_DIV32           CFG2_ADCPSC(30)                      /*!< ADC prescaler select CK_AHB/32 */

/* PLL clock source selection */
#define RCU_PLLSRC_IRC8M_DIV2           ((uint32_t)0x00000000U)              /*!< IRC8M/2 clock is selected as clock source of PLL */
#define RCU_PLLSRC_HXTAL                RCU_CFG0_PLLSEL                      /*!< HXTAL is selected as clock source of PLL */

